[{"id": "0801.0003", "abstract": ": We introduce a stochastic heterogeneous interacting-agent mod el for the short-time non-equilibrium evolution of excess demand and price in a stylized asse t market. We consider a combination of social interaction within peer groups and individually he terogeneous fundamentalist trading decisions which take into account the market price and the p erceived fundamental value of the asset. The resulting excess demand is coupled to the market pr ice. Rigorous analysis reveals that this feedback may lead to price oscillations, a single bounce, or m onotonic price behaviour. The model is a rare example of an analytically tractable interacting-a gent model which allows us to deduce in detail the origin of these diﬀerent collective patterns. For a natural choice of initial distribution the results are independent of the graph structure t hat models the peer network of agents whose decisions inﬂuence each other."}, {"id": "0801.0631", "abstract": ". Far-from-equilibrium models of interacting particles in o ne dimension are used as a basis for modelling the stock-market ﬂuctuations. Particle types an d their positions are interpreted as buy and sel orders placed on a price axis in the order book. We revisit some modiﬁcations of well-known models, starting withthe Bak-Paczuski-Shubikmodel. Welook at the four decades old Stigler model and investigate its variants. One of them is the simpliﬁed version of the Geno a artiﬁcial market. The list of studied models is completed by the models of Maslov and Daniels et al. Generi cally, in all cases we compare the return distribution, absolute return autocorrelation and the val ue of the Hurst exponent. It turns out that none of the models reproduces satisfactorily all the empirical dat a, but the most promising candidates for further development are the Genoa artiﬁcial market and the Maslov mo del with moderate order evaporation."}, {"id": "0801.0718", "abstract": ". In [4] the notion of stickiness for stochastic processes was intr oduced. It was also shown that stickiness implies absence of arbitrage in a market with pro portional transaction costs. In this paper, we investigate the notion of stickiness further. In particu lar, we give examples of processes that are not semimartingales but are sticky."}, {"id": "0801.0969", "abstract": "A deterministic system of interacting agents is considered as a model for economic dynamics. The dynamics of the system is described by a couple d map lattice with near neighbor interactions. Theevolution of each agent res ults from thecompetition between two factors: the agent’s own tendency to grow and the environmental inﬂu- ence that moderates this growth. Depending on the values of t he parameters that control these factors, the system can display Pareto or Bolt zmann-Gibbs statistical behaviors in its asymptotic dynamical regime. The regions w here these behaviors appear are calculated on the space of parameters of the syste m. Other statistical properties, such as themean wealth, the standarddeviation , and theGini coeﬃcient characterizing the degree of equity in the wealth distribut ion are also calculated on the space of parameters of the system. Key words: Multi-agent systems. Economic models. Pareto and Boltzman n-Gibbs distributions."}, {"id": "0801.1475", "abstract": "Weanalyze themultifractal spectraof daily foreign exchan gerates for Japan, Hong-Kong, Korea, and Thailand with respect to the United States Dollar from 19 91 to 2005. We ﬁnd that the return time series show multifractal spectrum features for all fou r cases. To observe the eﬀect of the Asian currency crisis, we also estimate the multifractal spectra of limited series before and after the crisis. We ﬁnd that the Korean and Thai foreign exchange markets expe rienced a signiﬁcant increase in multifractality comparedtoHong-KongandJapan. Wealsosh owthat themultifractality isstronge related to the presence of high values of returns in the serie s."}, {"id": "0801.1599", "abstract": ": Financial econometrics has become an increasingly popular re- search ﬁeld. In this paper we review a few parametric and nonp arametric models and methods used in this area. After introducing seve ral widely used continuous-time and discrete-time models, we study in detail depen- dence structures of discrete samples, including Markovian property, hid- den Markovian structure, contaminated observations, and r andom samples. We then discuss several popular parametric and nonparametr ic estima- tion methods. To avoid model mis-speciﬁcation, model valid ation plays a key role in ﬁnancial modeling. We discuss several model vali dation tech- niques, including pseudo-likelihood ratio test, nonparam etric curve regres- sion based test, residuals based test, generalized likelih ood ratio test, si- multaneous conﬁdence band construction, and density based test. Finally, we brieﬂy touch on tools for studying large sample propertie s."}, {"id": "0801.1710", "abstract": "Wehave performed detailed multifractal analysis on the min utely volatility of two indexes and 1139 stocks in the Chinese stock markets based on the part ition function approach. The partition function χq(s)scales as a power law with respect to box size s. The scaling exponents τ(q)form a nonlinear function of q. Statistical tests based on bootstrapping show that the extracted multifractal nature is signiﬁcant a t the 1% signiﬁcance level. The individual securities can be well modeled by the p-model in turbulence with p= 0.40± 0.02.Basedontheideaofensembleaveraging(including quenche d andannealedaverage), wetreat eachstock exchange asawholeandconﬁrm theexisten ce ofmultifractal nature in the Chinese stock markets."}]