[{"id": "0801.0003", "abstract": ": We introduce a stochastic heterogeneous interacting-agent mod el for the short-time non-equilibrium evolution of excess demand and price in a stylized asse t market. We consider a combination of social interaction within peer groups and individually he terogeneous fundamentalist trading decisions which take into account the market price and the p erceived fundamental value of the asset. The resulting excess demand is coupled to the market pr ice. Rigorous analysis reveals that this feedback may lead to price oscillations, a single bounce, or m onotonic price behaviour. The model is a rare example of an analytically tractable interacting-a gent model which allows us to deduce in detail the origin of these diﬀerent collective patterns. For a natural choice of initial distribution the results are independent of the graph structure t hat models the peer network of agents whose decisions inﬂuence each other."}, {"id": "0801.0631", "abstract": ". Far-from-equilibrium models of interacting particles in o ne dimension are used as a basis for modelling the stock-market ﬂuctuations. Particle types an d their positions are interpreted as buy and sel orders placed on a price axis in the order book. We revisit some modiﬁcations of well-known models, starting withthe Bak-Paczuski-Shubikmodel. Welook at the four decades old Stigler model and investigate its variants. One of them is the simpliﬁed version of the Geno a artiﬁcial market. The list of studied models is completed by the models of Maslov and Daniels et al. Generi cally, in all cases we compare the return distribution, absolute return autocorrelation and the val ue of the Hurst exponent. It turns out that none of the models reproduces satisfactorily all the empirical dat a, but the most promising candidates for further development are the Genoa artiﬁcial market and the Maslov mo del with moderate order evaporation."}, {"id": "0801.0718", "abstract": ". In [4] the notion of stickiness for stochastic processes was intr oduced. It was also shown that stickiness implies absence of arbitrage in a market with pro portional transaction costs. In this paper, we investigate the notion of stickiness further. In particu lar, we give examples of processes that are not semimartingales but are sticky."}, {"id": "0801.0969", "abstract": "A deterministic system of interacting agents is considered as a model for economic dynamics. The dynamics of the system is described by a couple d map lattice with near neighbor interactions. Theevolution of each agent res ults from thecompetition between two factors: the agent’s own tendency to grow and the environmental inﬂu- ence that moderates this growth. Depending on the values of t he parameters that control these factors, the system can display Pareto or Bolt zmann-Gibbs statistical behaviors in its asymptotic dynamical regime. The regions w here these behaviors appear are calculated on the space of parameters of the syste m. Other statistical properties, such as themean wealth, the standarddeviation , and theGini coeﬃcient characterizing the degree of equity in the wealth distribut ion are also calculated on the space of parameters of the system. Key words: Multi-agent systems. Economic models. Pareto and Boltzman n-Gibbs distributions."}, {"id": "0801.1475", "abstract": "Weanalyze themultifractal spectraof daily foreign exchan gerates for Japan, Hong-Kong, Korea, and Thailand with respect to the United States Dollar from 19 91 to 2005. We ﬁnd that the return time series show multifractal spectrum features for all fou r cases. To observe the eﬀect of the Asian currency crisis, we also estimate the multifractal spectra of limited series before and after the crisis. We ﬁnd that the Korean and Thai foreign exchange markets expe rienced a signiﬁcant increase in multifractality comparedtoHong-KongandJapan. Wealsosh owthat themultifractality isstronge related to the presence of high values of returns in the serie s."}, {"id": "0801.1599", "abstract": ": Financial econometrics has become an increasingly popular re- search ﬁeld. In this paper we review a few parametric and nonp arametric models and methods used in this area. After introducing seve ral widely used continuous-time and discrete-time models, we study in detail depen- dence structures of discrete samples, including Markovian property, hid- den Markovian structure, contaminated observations, and r andom samples. We then discuss several popular parametric and nonparametr ic estima- tion methods. To avoid model mis-speciﬁcation, model valid ation plays a key role in ﬁnancial modeling. We discuss several model vali dation tech- niques, including pseudo-likelihood ratio test, nonparam etric curve regres- sion based test, residuals based test, generalized likelih ood ratio test, si- multaneous conﬁdence band construction, and density based test. Finally, we brieﬂy touch on tools for studying large sample propertie s."}, {"id": "0801.1710", "abstract": "Wehave performed detailed multifractal analysis on the min utely volatility of two indexes and 1139 stocks in the Chinese stock markets based on the part ition function approach. The partition function χq(s)scales as a power law with respect to box size s. The scaling exponents τ(q)form a nonlinear function of q. Statistical tests based on bootstrapping show that the extracted multifractal nature is signiﬁcant a t the 1% signiﬁcance level. The individual securities can be well modeled by the p-model in turbulence with p= 0.40± 0.02.Basedontheideaofensembleaveraging(including quenche d andannealedaverage), wetreat eachstock exchange asawholeandconﬁrm theexisten ce ofmultifractal nature in the Chinese stock markets."}, {"id": "0801.2980", "abstract": "We develop a model of tax evasion based on the Ising model. We augment the model using an appropriate enforcement mechanism that may allow policy makers to curb tax evasion. With a certain probability tax evaders are subject to an audit. If they get caught they behave honestly for a certain number of periods. Simulating the model for a range of parameter combinations, we show that tax evasion may be controlled ef- fectively by using punishment as an enforcement mechanism. ["}, {"id": "0801.3043", "abstract": "In high frequency ﬁnancial data not only returns but also wai ting times between trades arerandomvariables. Inthis work, weanalyze thespe ctraof thewaiting-time processes for tick-by-tick trades. The numerical problem, strictly related with the real inversion of Laplace transforms, is analyzed by using T ikhonov’s regularization method. We also analyze these spectra by a rough method using a comb of Dirac’s delta functions. Key words: Econophysics; Exponential distribution; Inverse problem s"}, {"id": "0801.3047", "abstract": ". The pap er deals with the problem of iden tifying the in ternal dep endencies and similarities among a large n um b er of random pro cesses. Linear mo dels are considered to describ e the relations among the time series and the energy asso ciated to the corresp onding mo deling error is the criterion adopted to quan tify their similarities. Suc h an approac h is in terpreted in terms of graph theory suggesting a natural w a y to group pro cesses together when one pro vides the b est mo del to explain the other. Moreo v er, the clustering tec hnique in tro duced in this pap er will turn out to b e the dynamical generalization of other m ultiv ariate pro cedures describ ed in literature."}, {"id": "0801.3263", "abstract": "Incomplex systems such as turbulent ﬂows andﬁnancial marke ts, thedynamics inlong and short time-lags, signaled by Gaussian and fat-tailed statistics , respectively, calls for a uniﬁed description. To address this issue we analyze a real dataset, namely, pric e ﬂuctuations, in a wide range of tem- poral scales to embrace both regimes. By means of Kramers-Mo yal (KM) coeﬃcients evaluated from empirical time series, we obtain the evolution equatio n for the probability density function (PDF) of price returns. We also present consistent asymptot ic solutions for the timescale depen- dent equation that emerges from the empirical analysis. Fro m these solutions, new relationships connecting PDF characteristics, such as tail exponents, to parameters of KM coeﬃcients arise. The results reveal a dynamical path that leads from Gaussian to f at-tailed statistics, furnishing insights on other complex systems where akin crossover is observed."}, {"id": "0801.3348", "abstract": "We consider the Brownian market model and the problem of expecte d utility max- imization of terminal wealth. We, speciﬁcally, examine the problem of m aximizing the utility of terminal wealth under the presence of transaction costs of a fund/agent invest- ing in futures markets. We oﬀer some preliminary remarks about sta tistical arbitrage strategies and we set the framework for futures markets, and in troduce concepts such as margin, gearingandslippage. Thesettingisofdiscretetime, andthe priceevolutionofthe futures prices is modelled as discrete random sequence involving Ito ’s sums. We assume the drift and the Brownian motion driving the return process are no n-observable and the transaction costs are represented by the bid-ask spread. We pr ovide explicit solution to the optimal portfolio process, and we oﬀer an example using logarith mic utility."}, {"id": "0801.3560", "abstract": "A simple trading model based on pair pattern strategy space w ith holding periods is pro- posed. Power-law behaviors are observed for the return vari anceσ2, the price impact H and thepredictability Kfor both models withlinear and square root impact functions . The sum of the traders’ wealth displays a positive value for the m odel with square root price impact function, andaqualitative explanation isgivenbas ed ontheobservation of thecon- ditional excess demand /an}bracketle{tA|u/an}bracketri}ht. An evolutionary trading model is further proposed, and the elimination mechanism effectively changes thebehavior of thetraders highly performed in the model without evolution. The trading model with other ty pes of traders, e.g., traders withthe MG’sstrategies and producers, arealso carefully s tudied."}, {"id": "0801.3712", "abstract": "We have analyzed the statistical probabilities of limit-or der book (LOB) shape through building the book using the ultra-high-frequency data from 23 liquid stocks traded on the Shenzhen Stock Exchange in 2003. We ﬁnd that the averaged LOB shape has a maximum away from the same best price for both buy and sell LOBs. The LO B shape function has nice exponential form in the right tail. The buy LOB is found t o be abnormally thicker for thepricelevelsclosetothesamebestalthoughtherearemuc hmoresellordersonthebook. We also ﬁnd that the LOB shape functions for both buy and sell s ides have periodic peaks with a period of ﬁve. The 1-min averaged volumes at ﬁxed tick l evel follow lognormal distributions, except for the left tails which display powe r-law behaviors, and exhibit long memory. Academic implications of our empirical results are also discussed brieﬂy. Key words: Econophysics; Stock markets; Continuous double action; Li mit-order book shape; Microstructure theory"}, {"id": "0801.3973", "abstract": ". We show that a simple model of a spatially resolved evolving e conomic system, which has a steady state under simultaneous updating, shows stable osc illations in price when updated asynchronously. The oscillations arise from a gradual decline of the mean pri ce due to competition among sellers competing for the same resource. This lowers proﬁtability and hence po pulation but is followed by a sharp rise as speculative sellers invade the large un-inhabited areas. T his cycle then begins again."}, {"id": "0801.4047", "abstract": ". Strict local martingales may admit arbitrage opportunities with resp ect to the class of simple trading strategies. (Since there is no possibility of using dou bling strategies in this framework, the losses are not assumed to be bounded from below.) We show that for a class of non-negativestrict localmartingales, the strongMarkovproper tyimplies the noarbitrageproperty with respect to the class of simple trading strategies. This result ca n be seen as a generalization of a similar result on three dimensional Bessel process in [ 3]. We also provide no arbitrage conditions for stochastic processes within the class of simple trading strateg ies with shortsale restriction."}, {"id": "0801.4220", "abstract": ". We study the problem of forecasting volatility for the multifractal random walk model. In order to avoid the ill posed problem of estimatin g the correlation length Tof the model, we introduce a limiting object deﬁned in a quotientspace;formally,thisobjectisaninﬁnite rangelogvolatility. Forthisobject and the non limiting object, we obtain precise prediction formulas and we apply them to the problem of forecasting volatility and pricing options with t he MRW model in the absence of a reliable estimate of σandT. Key words or phrases: Random measures, Gaussian processes, Prediction theory, Multif ractal processes. MSC 2000 subject classiﬁcations: 60G57, 60G15, 60G25, 28A8 0"}, {"id": "0801.4341", "abstract": "y Thisypaperyintendsytoymeetyrecentyclaimsyforytheyat tainmentyofymoreyrigorousystatisticaly methodologyy withiny they econophysicsy literature.y Toy thisy end,y wey considery any econometricyapproachytoyinvestigateytheyoutcomesyof ytheylog&periodicymodelyofypricey movements,y whichyhasybeeny largelyy usedy toyforecasty financialycrashes.yInyorderytoy accomplishyreliableystatisticalyinferenceyforyunkno wnyparameters,yweyincorporateyany autoregressiveydynamicyandyayconditionalyheterosked asticityystructureyinytheyerrorytermy ofytheyoriginalymodel,yyieldingytheylog&periodic&AR (1)&GARCH(1,1)ymodel.y Bothy they originalyandytheyextendedymodelsyareyfittedytoyfina ncialyindicesyofyU.yS.ymarket,ynamelyy S&P500yandyNASDAQ.yOuryanalysisyrevealytwoymainypoi nts:y(i)ytheylog&periodic&AR(1)& GARCH(1,1)y modely hasy residualsy withy bettery statisti caly propertiesy andy (ii)y they estimationy ofy they parametery concerningy they timey ofy they financialy crashy hasy beeny improved.yyy y"}, {"id": "0802.0214", "abstract": "This paper develops a Bayesianprocedure for estimation and forec astingof the volatil- ity of multivariate time series. The foundation of this work is the matr ix-variate dynamic linear model, for the volatility of which we adopt a multiplicative stochas tic evolution, using Wishart and singular multivariate beta distributions. A diagonal matrix of discount factors is employed in order to discount the variances element by ele ment and therefore allowing a ﬂexible and pragmatic variance modelling approach. Diagnost ic tests and se- quential model monitoring are discussed in some detail. The propose d estimation theory is applied to a four-dimensional time series, comprising spot prices of aluminium, copper, lead and zinc of the London metal exchange. The empirical ﬁndings s uggest that the pro- posed Bayesian procedure can be eﬀectively applied to ﬁnancial dat a, overcoming many of the disadvantages of existing volatility models. Some key words: Time series, volatility, multivariate, dynamic linear model, Bayesian, forecasting, state space, Kalman ﬁlter, GARCH, London metal ex change. 1"}, {"id": "0802.0220", "abstract": "The purpose of this paper is to propose a time-varying vector autoregressive model (TV-VAR) for forecasting multivariate time series. The mod el is casted into a state-space form that allows ﬂexible description and analysis. The vola tility covariance matrix of the time series is modelled via inverted Wishart and singular mu ltivariate beta distributions allowing a fully conjugate Bayesian inference. Model perfo rmance and model compar- ison is done via the likelihood function, sequential Bayes f actors, the mean of squared standardized forecast errors, the mean of absolute forecas t errors (known also as mean absolute deviation), and the mean forecast error. Bayes fac tors are also used in order to choose the autoregressive order of the model. Multi-step forecasting is discussed in detail and a ﬂexible formula is proposed to approximate the f orecast function. Two ex- amples, consisting of bivariate data of IBM shares and of for eign exchange (FX) rates for 8 currencies, illustrate the methods. For the IBM data we discuss model performance and multi-step forecasting in some detail. For the FX data we discuss sequential portfolio allocation; for both data sets our empirical ﬁndings sugges t that the TV-VAR models outperform the widely used VAR models. Some key words: Bayesian forecasting, multivariate time series, stochast ic volatility, state space, foreign exchange rates, portfolio allocation . 1"}, {"id": "0802.0223", "abstract": "A Bayesian procedure is developed for multivariate stochastic volat ility, using state space models. An autoregressive model for the log-returns is emp loyed. We generalize the inverted Wishart distribution to allow for diﬀerent correlation st ructure between the observation and state innovation vectors and we extend the conv olution between the Wishart and the multivariate singular beta distribution. A multiplicative model based on the generalized inverted Wishart and multivariate singular beta distr ibutions is proposed for the evolution of the volatility and a ﬂexible sequential volatility upd ating is employed. The proposed algorithm for the volatility is fast and computationally c heap and it can be used for on-line forecasting. The methods are illustrated with an example consisting of foreign exchange rates data of 8 currencies. The empirical res ults suggest that time- varying correlations can be estimated eﬃciently, even in situations o f high dimensional data. Some key words: volatility, multivariate, GARCH, time series, state space model, Bayesian forecasting, dynamic linear model, Kalman ﬁlter, generalize d Wishart distribu- tion. 1"}, {"id": "0802.0984", "abstract": "We propose a new indicator for technical analysis. The indic ator emphasizes maximums and minimums in price series with inher ent smoothing and has a potential to be useful in both mechanical trading rules and chart pattern analysis."}, {"id": "0802.1288", "abstract": "frameworkbyconsidering Masaﬁnite-dimensionalsmoothsub- manifold of E. The concept of invariance used in this work is the following : Definition 4."}, {"id": "0802.1407", "abstract": "We consider the intensity-based approach for the modeling o f default times of one or more companies. In this approach the default times are deﬁned as t he jump times of a Cox process, which is a Poisson process conditional on the realization of its intensity. We assume that the intensity follows the Cox-Ingersoll-Ross model. This mode l allows one to calculate survival probabilities and prices of defaultable bonds explicitly. In this paper we assume that the Brownian motion, that drives the intensity, is not observed . Using ﬁltering theory for point process observations, we are able to derive dynamics for the intensity and its moment generat- ing function, given the observations of the Cox process. A tr ansformation of the dynamics of the conditional moment generating function allows us to sol ve the ﬁltering problem, between the jumps of the Cox process, as well as at the jumps. Assuming that the initial distribution of the intensity is of the Gamma type, we obtain an explicit so lution to the ﬁltering problem for allt >0. We conclude the paper with the observation that the result ing conditional moment generating function at time t, afterNtjumps, corresponds to a mixture of Nt+ 1 Gamma distributions."}, {"id": "0802.1416", "abstract": ": Econophy sics embodies the recent upsurge of interest by phys icists into financial econom ics, driven by the availability of large amount of data, job shortage in phys ics and the possibility of applying many-body techniques developed in statistical and theoretical phys ics to the unde rstanding of the self-organizing econom y. This brief historical survey emphasizes that Econophy sics has many historical precursors, and is in fact rooted in a continuous cross-fertilization between econom ics and phys ics that has been active in the last centuries. Main text The term Econophy sics was introduced circa 1994 , endorsed in 1999 by the publication of its foundi ng book, Mantegna-Stanley’s “An Introduc tion to Econophys ics” (1999) . The word “econophys ics” sugge sts that there is a phys ical approach to econom ics, perhaps even that econom ics can be rooted in phys ics, paralleling the quests of biophys ics or geophys ics. Indeed, all along its developments, from classical to neo-classical econom ics and till the present time, econom ists have been inspired by the conceptual and mathematical developments of the phys ical sciences and by their remarkable successes in describing and predicting natural phenomena. Reciprocally, physics has been enriched several times by developments first observed in econom ics. Well before the christening of econophys ics as the incarnation of the multidisciplinary study of complex large-scale financial and econom ic systems, a multiple of small and large collisions have punc tuated the development of these two fields. Let us now mention a few that illustrate the remarkable commonalities and inter-fertilization. In his “Inquiry into the Nature and Causes of the Wealth of Nations” (1776 ), Adam Smith found inspiration in the Philosophiae Naturalis Principia Mathematica (1687 )"}, {"id": "0802.1500", "abstract": "We investigated ﬁnancial market data to determine which fac tors aﬀect information ﬂow be- tween stocks. Two factors, the time dependency and the degre e of eﬃciency, were considered in the analysis of Korean, the Japanese, the Taiwanese, the Can adian, and US market data. We found that the frequency of the signiﬁcant information decr eases as the time interval increases. However, no signiﬁcant information ﬂow was observed in the t ime series from which the temporal time correlation was removed. These results indicated that the information ﬂow between stocks ev- idences time-dependency properties. Furthermore, we disc overed that the diﬀerence in the degree of eﬃciency performs a crucial function in determining the d irection of the signiﬁcant information ﬂow."}, {"id": "0802.1747", "abstract": ". - Using transfer entropy, we observed the strength and direc tion of information ﬂow between stock indices. We uncovered that the biggest source of information ﬂow is America. In contrast, the Asia/Paciﬁc region the biggest is receives th e most information. According to the minimum spanning tree, the GSPC is located at the focal point of the information source for world stock markets."}, {"id": "0802.1823", "abstract": ". We consider a class of asset pricing models, where the risk-n eutral joint process of log-price and its stochastic variance is an aﬃne process in the sense of Duﬃe, Filipovic, and Schachermayer [2003]. First w e obtain condi- tions for the price process to be conservative and a martinga le. Then we present some results on the long-term behavior of the model, including an ex- pression for the invariant distribution of the stochastic v ariance process. We study moment explosions of the price process, and provide ex plicit expressions for the time at which a moment of given order becomes inﬁnite. We discuss applications of these results, in particular to the asympto tics of the implied volatility smile, and conclude with some calculations for t he Heston model, a model of Bates and the Barndorﬀ-Nielsen-Shephard model."}, {"id": "0802.2004", "abstract": "We show that a simple and intuitive three-parameter equatio n ﬁts remarkably well the evolution of the gross domestic product (GDP) in cur rent and constant dollars of many countries during times of recession and reco very. We then argue thatthisequationistheresponsefunctionoftheeconomyto isolatedshocks,hence that it can be used to detect large and small shocks, includin g those which do not lead to a recession; we also discuss its predictive power. Fi nally, a two-sector toy modelofrecessionandrecoveryillustrateshowtheseverit yandlengthofrecession depends on the dynamics of transfer rate between the growing and failing parts of the economy."}, {"id": "0802.3039", "abstract": ". We analyze analytic approximation formulae for pricing zer o- coupon bonds in the case when the short-term interest rate is driven by a one-factor mean-reverting process with a volatility nonli nearly depending on the interest rate itself. We derive the order of accuracy of t he analytical ap- proximation due to Choi and Wirjanto. We furthemore give an e xplicit formula for a higher order approximation and we test both approximat ions numerically for a class of one-factor interest rate models. Key Words. One factor interest rate model, Cox-Ingersoll-Ross model, bond price, analytical approximation formula, experimental or der of convergence."}, {"id": "0802.3250", "abstract": ": We develop a theory for valuing non-diversiﬁable mortality risk in an incomplete mar- ket. We do this by assuming that the company issuing a mortali ty-contingent claim requires compensation for this risk in the form of a pre-speciﬁed inst antaneous Sharpe ratio. We apply our method to value life annuities. One result of our paper is that the value of the life annuity isidentical to the upper good deal bound of Cochrane and Sa´ a-Requejo (20 00) and of Bj¨ ork and Slinko (2006) applied to our setting. A second result of our p aper is that the value per contract solves alinearpartial diﬀerential equation as the number of contracts app roaches inﬁnity. One can represent the limiting value as an expectation with respect to an equivalent martingale measure (as in Blanchet-Scalliet, El Karoui, and Martellini (2005) ), and from this representation, one can interpret the instantaneous Sharpe ratio as an annuity mark et’s price of mortality risk."}, {"id": "0802.3585", "abstract": "We combine general equilibrium theory and th´ eorie g´ en´ erale of stochastic processes to derive structural results about equilibrium state prices."}, {"id": "0802.3679", "abstract": "The proposed model modifies option pricing formulas for the basic case of log-normal probability distribution providing correspondence to formulated criteria of efficiency and completeness. The model is self-calibrating by historic volatility data; it maintains the constant expected value at maturity of the hedged instantaneously self-financing portfolio. The payoff variance dependent on random stock price at maturity obtained under an equivalent martingale measure is taken as a condition for introduced “mirror- time” derivative diffusion discount process. Introduced ξ-returns, correspondent to the found general solution of backward drift-diffusion equation and normalized by theoretical diffusion coefficient, don’t contain so-called “long tails” and unbiased for considered 2004-2007 S&P100 index data. The model theoretically yields skews correspondent to practical term structure for interest rate derivatives. The method allows increasing the number of asset price probability distribution parameters."}, {"id": "0802.4165", "abstract": ": In the Minority, Majority and Dollar Games (MG, MAJG, $G) synthetic agents compete for rewards, at each time-step acting in accord with th e previously best-performing of their limited sets of strategies. Different components and/or aspects of real-world financial markets are modelled by these games. In the MG, agents compete for scarce resources; in the MAJG agents imitate the group in the hope of exploiting a trend; in the $G agents attempt to su ccessfully predict and benefit from trends as well as changes in the direction of a market. It has been previously shown that in the MG for a reasonable number of preliminary time steps preceding equilibrium (Tim e Horizon MG, THMG), agents’ attempt to optimize their gains by active strategy selection is “illusory”: Th e calculated hypothetical gains of their individual strategies is greater on average than agents’ actual av erage gains. Furthermore, if a small proportion of agents deliberately choose and act in accord with their seemingly worst performing strategy, these outper- form all other agents on average, and even attain m ean positive gain, otherwise rare for agents in the MG. This latter phenomenon raises the question as to how well the optimization procedure works in the MAJG and $G. We demonstrate that the illusion of control is absent in MAJG and $G. In other words, low- entropy (more informative) strategies under-perform high-entropy (or random) strategies in the MG but outperform them in the MAJG and $G. This provides furt her clarification of the kinds of situations subject to genuine control, and those not, in set-ups a priori defined to emphasize the importance of optimization."}, {"id": "0802.4311", "abstract": "We study multistep Bayesian betting strategies in coin-tos sing games in the framework of game-theoretic probability of Shafer and Vovk (2001). We show that by a countable mixture of these strategies, a gambler or an in vestor can exploit arbitrary patterns of deviations of nature’s moves from ind ependentBernoulli trials. We then apply our scheme to asset trading games in continuous time and derive the exponential growth rate of the investor’s capital when the v ariation exponent of the asset price path deviates from two."}, {"id": "0802.4411", "abstract": "The transition probability of a Cox–Ingersoll–Ross proces s can be repre- sented by a non-central chi-square density. First we prove a new representation for the central chi-square density based on sums of powers of genera lized Gaussian random variables. Second we prove Marsaglia’s polar method extend s to this distribution, pro- viding a simple, exact, robust and eﬃcient acceptance-reje ction method for generalized Gaussian sampling and thus central chi-square sampling. Th ird we derive a simple, high-accuracy, robust and eﬃcient direct inversion method for generalized Gaussian sampling based on the Beasley–Springer–Moro method. Indee d the accuracy of the approximation to the inverse cumulative distribution func tion is to the tenth decimal place. We then apply our methods to non-central chi-square v ariance sampling in the Heston model. We focus on the case when the number of degrees o f freedom is small and the zero boundary is attracting and attainable, typical in foreign exchange mar- kets. Using the additivity property of the chi-square distr ibution, our methods apply in all parameter regimes."}, {"id": "0802.4460", "abstract": "The paper is devoted to elaboration of a novel specific indicator based on the modified Holder exponents. This indicator has been used for forecasting critical points of financial time series and crashes of the USA stock market. The proposed approach is based on the hypothesis, wh ich claims that before market critical points occur the dynamics of financial time series radically changes, namely time series become smoother. The approach has be en tested on the stylized data an d real USA stock market data. It has been shown that it is possible to forecast such cr itical points of financial ti me series as large upward and downward movements and trend changes. On this basis a new trading strategy has been elaborated and tested."}, {"id": "0802.1121", "abstract": "In the context of a Brownian ﬁltration and with a ﬁxed ﬁnite ti me horizon, we will provide a representation of the penalty ter m of general dynamic concave utilities (hence of dynamic convex risk mea sures) by applying the theory of g-expectations. 1"}, {"id": "0802.4064", "abstract": ": We suggest an analytical approach for Pareto-Zipf law, where we assume random multiplicative noise and fragmentation processes fo r the growth of the number of citizens of each city and the number of the cities, respectively."}, {"id": "0803.0436", "abstract": "ThepersistencephenomenonisstudiedintheJapaneseﬁnanc ialmarketbyusinganovelmapping of the time evolution of the values of shares quoted on the Nik kei Index onto Ising spins. The method is applied to historical end of day data from the Japan ese stock market during 2002. By studying the time dependence of the spins, we ﬁnd clear evide nce for a double-power law decay of the proportion of shares that remain either above or below ‘starting’ values chosen at random. The results are consistent with a recent analysis of the data from the London FTSE100 market. The slopes of the power-laws are also in agreement. We estima te a long time persistence exponent for the underlying Japanese ﬁnancial market to be 0.5."}, {"id": "0803.0844", "abstract": "A dynamic herding model with interactions of trading volume s is introduced. At time t, an agent trades with a probability, which depends on the ratio of the total trading volume at time t−1 to its own trading volume at its last trade. The price return is determined by the volume imba lance and number of trades. The model successfully reproducesthe power-law distributions of the trading volu me, number of trades and price return, and their relations. Moreover,the generatedtime series are long-rangecorrela ted. We demonstratethat the results are rather robust, and donotdependontheparticularformofthetradingprobabili ty."}, {"id": "0803.1589", "abstract": "We will compare three types of prices, namely, rational (hedging) p rices, geometric (growth rate) prices, and martingale (measure) prices. We will sho w that rational prices in the complete market theory are sometimes contrary to co mmon sense. In the continuous-time case, we insist that the market model should d iﬀer between the small volatility case ( σ2/2≤r) and the large volatility case ( r < σ2/2). 2000 Mathematics Subject Classiﬁcation: primary 91B24; seconda ry 91B28."}, {"id": "0803.1858", "abstract": ". A ﬁnancial market comprising of a certain number of distinct companies is con- sidered, and the following statement is proved: either a spe ciﬁc agent will surely beat the whole market unconditionally in the long run, or (and this “o r” is not exclusive) all the capital of the market will accumulate in one company. Thus, absence o f any “free unbounded lunches relative to the total capital” opportunities lead to the mos t dramatic failure of diversity in the market: one company takes over all other until the end of t ime. In order to prove this, we introduce the notion of perfectly balanced markets, which is an equilibrium state in which the relative capitalization of each company is a martingale under the physical probability. Then, the weaker notion of balanced markets is discussed where the martingale property of the relative capitalizations holds only approximately , we show how these concepts relate to growth-optimality and eﬃciency of the market, as well as how we can infer a shadowinterest rate that is implied in the economy in the absence of a bank. 0."}, {"id": "0803.1877", "abstract": ". We study the existence of the num´ eraire portfolio under predictable convex con- straints in a general semimartingale model of a ﬁnancial mar ket. The num´ eraire portfolio generates a wealth process, with respect to which the relati ve wealth processes of all other portfolios are supermartingales. Necessary and suﬃcient c onditions for the existence of the num´ eraire portfolio are obtained in terms of the triplet of predictable characteristics of the asset price process. This characterization is then used to o btain further necessary and suf- ﬁcient conditions, in terms of a no-free-lunch-type notion . In particular, the full strength of the “No Free Lunch with Vanishing Risk” (NFLVR) is not need ed, only the weaker “No Unbounded Proﬁt with Bounded Risk” (NUPBR) condition that i nvolves the boundedness in probability of the terminal values of wealth processes. W e show that this notion is the minimal a-priori assumption required in order to proceed wi th utility optimization. The fact that it is expressed entirely in terms of predictable charac teristics makes it easy to check, something that the stronger NFLVR condition lacks. 0."}, {"id": "0803.1890", "abstract": ". A ﬁnancial market model where agents trade using realistic c ombinations of buy-and- holdstrategies is considered. Minimal assumptions are made on t he discounted asset-price process — in particular, the semimartingale property is notassumed. Via a natural market viability as- sumption, namely, absence of arbitrages of the ﬁrst kind, we establish that discounted asset-prices haveto be semimartingales. In a slightly more specialized case, we extend the previous result in a weakened version of the Fundamental Theorem of Asset Prici ng that involves strictly positive supermartingale deﬂators rather than Equivalent Martinga le Measures."}, {"id": "0803.2169", "abstract": ". We provide equivalence of numerous no-free-lunch type cond itions for ﬁnan- cial markets where the asset prices are modeled as exponenti al L´ evy processes, under possible convex constraints in the use of investment strate gies. The general message is the following: if any kind of free lunch exists in these model s it has to be of the most egregious type, generating an increasing wealth. Furthermore, we connect the previous to the existence of the num´ eraire portfolio , both for its particular expositional clarity in exponential L´ evy models and as a ﬁrst step in obtaining anal ogues of the no-free-lunch equivalences in general semimartingale models, a task that is taken on in Karatzas and Kardaras [21]. 0."}, {"id": "0803.2198", "abstract": ". We consider two risk-averseﬁnancial agents who negotiate the pr ice of an illiquid indivisible contingent claim in an incomplete semimartingale market enviro nment. Under the assumption that the agents are exponential utility maximizers w ith non-traded random endowments, we provide necessary and suﬃcient conditions for ne gotiation to be successful,"}, {"id": "0803.2201", "abstract": "Anderson [1] proposed the concept of complexity in order to d e- scribetheemergenceandgrowthofmacroscopiccollective p atternsout of the simple interactions of many microscopic agents. In th e physical sciences this paradigm was implemented systematically and conﬁrmed repeatedly by successful confrontation with reality. In th e social sci- ences however, the possibilities to stage experiments to va lidate it are limited. During the 90’s a series of dramatic political and e conomic events have provided the opportunity to do so. We exploit the re- sulting empirical evidence to validate a simple agent based alternative to the classical logistic dynamics. The post-liberalizati on empirical data from Poland conﬁrm the theoretical prediction that the dynam- ics is dominated by singular rare events which insure the res ilience and adaptability of the system. We have shown that growth is l ed by few singular ”growth centers” (Figure 1), that initially de veloped at a tremendous rate (Figure3), followed by a diﬀusion process to the rest of thecountry andleading to a positive growth rate uniforma cross the counties. In addition to the interdisciplinary unifying po tential of our 1 generic formal approach, the present work reveals the stron g causal ties between the ”softer” social conditions and their ”hard ” economic consequences. 1"}, {"id": "0803.2283", "abstract": ". It is shown that the axioms for coherent risk measures imply that whenever there is an asset in a portfolio that dominates the others in a given sample (which happens with ﬁnite probability even for large samples), then this portfolio cannot be optimized under any coherent measure on that sample, and the risk measure diverges to minu s inﬁnity. This instability was ﬁrst discovered on the special example of Expected Shortfall which is used here both as an illustration and as a p rompt for generalization."}, {"id": "0803.2302", "abstract": "In this paper we consider the problem of pricing a perpetual A merican put option in an exponential regime-switching L´ evy model. For the case of the (dense) class of phase-type jumps and ﬁnitely many reg imes we derive an explicit expression for the value function. The so lution of the corresponding ﬁrst passage problem under a state-dependen t level rests on a path transformation and a new matrix Wiener-Hopf factor ization result for this class of processes."}, {"id": "0803.2388", "abstract": "In recent years, the economic policy of privatization, whic h is deﬁned as the transfer of prop- erty or responsibility from public sector to private sector , is one of the global phenomenon that increases use of markets to allocate resources. One importa nt motivation for privatization is to help develop factor and product markets, as well as security markets. Progress in privatization is correlated with improvements in perceived political and in vestment risk. Many emerging countries have gradually reduced their political risks during the cou rse of sustained privatization. In fact, most risk resolution seems to take place as privatization pr oceeds to its later stage. Alternative beneﬁts of privatization are improved risk sharing and incr eased liquidity and activity of the mar- ket. One of the main methods to develop privatization is ente ring a new stock to the markets for arising competition. However, attention to the capability of the markets to accept a new stock is substantial. Without considering the above statement, i t is possible to reduce the market’s eﬃciency. In other words,"}, {"id": "0803.2635", "abstract": "Consider the one-parameter generalizations of the logarit hmic and exponential functions which are obtained from the i ntegration of non-symmetrical hyperboles. These generalizations coi ncide to the one obtained in the context of non-extensive the rmostatistics. We show that these functions are suitable to describe and uni fy the great majority of continuous growth models, which we b rieﬂy review. Physical interpretation to the generalization fun ction parameter is given for the Richards’ model, which has a n underlying microscopic model to justify it. Key words: population dynamics, generalized logarithmic and exponen tial functions, growth models, Richard’s model, Marusic an d Bajzer’s model, Tsoularis and Wallace’s model"}, {"id": "0803.2996", "abstract": "The use of equilibrium models in economics springs from the desire for parsimonious models of economic phenomena that take human rea- soning into account. This approach has been the cornerstone of modern economic theory. We explain why this is so, extolling the virtues of equilibrium theory; then we present a critique and describe why this approach is inherently limited, and why economics needs to move in new directions if it is to continue to make progress. We stress that this shouldn't be a question of dogma, but should be resolved empir- ically. There are situations where equilibrium models provide useful predictions and there are situations where they can never provide use- ful predictions. There are also many situations where the jury is still out,"}, {"id": "0803.3093", "abstract": "A ﬁnancial market is called “diverse” if no single stock is ev er allowed to dominate the entire market in terms of relative capitalization. In th e context of the standard Itˆ o-process model initiated by Samuelson (1965) we formul ate this property (and the allied, successively weaker notions of “weak diversity” an d “asymptotic weak diver- sity”) in precise terms. We show that diversity is possible t o achieve, but delicate. Several illustrative examples are provided, which demonst rate that weakly-diverse ﬁ- nancial markets contain relative arbitrage opportunities : it is possible to outperform (or underperform) such markets over arbitrary time-horizo ns. The existence of such relative arbitrage does not interfere with the development of option pricing, and has interesting consequences for the pricing of long-term warr ants and for put-call parity. Several open questions are suggested for further study. Key Words and Phrases: Financial markets, portfolios, diversity, relative arbitrage, order statistics, local times, stochastic diﬀerential equations, s trict local martingales. AMS 2000 Subject Classiﬁcations: Primary 60H10, 91B28; secondary 60J55."}, {"id": "0803.3590", "abstract": ". We propose a simple model forthe behaviour of longterm inves tors on a stock market, consisting of three particles, which repr esent the current price of the stock and the opinion of the buyers, respectivel y sellers, about the right trading price. As time evolves, both groups of trad ers update their opinions with respect to the current price. The update speed is controled by a parameter γ, the price process is described by a geometric Brownian motion. We consider the stability of the market in terms of th e distance between the buyers’ and sellers’ opinion, and prove that the distance process is recurrent/transient in dependence on γ."}, {"id": "0803.3884", "abstract": "Inthispaperweanalyzeddependenciesincommoditymarkets investigatingcorre- lationsoffuturecontractsforcommoditiesovertheperiod 1998.09.01-2007.12.14. Weconstructedaminimalspanningtreebasedonthecorrelat ionmatrix.Thetree providesevidenceforsectorclusterizationofinvestigat edcontracts.Wealsostud- ieddynamicalpropertiesofcommoditydependencies.Ittur nedoutthatthemarket wasconstantlygettingmorecorrelatedwithintheinvestig atedperiod,althoughthe increaseofcorrelationwasdistributednonuniformlyamon gallcontracts,andde- pendedoncontractsbranches."}, {"id": "0803.4046", "abstract": "We aim to construct the optimal solutions to the undiscounted continuous-time infinite horizon optimization problems, the objective functionals of which may be unbounded. We identify the condition under whic h the limit of the solutions to the finite horizon problems is optimal for the infinite horizon prob lems under the overtaking criterion."}, {"id": "0803.4050", "abstract": "We aim to generalize Cai and Nitta’s (2007) results by allowing both the utility and production function to depend on time. We also consider an additional intertemporal optimality criterion. We clarify the conditions under which the limit of the solutions for the finite horizon problems is optimal among a ll attainable paths for the infinite horizon problems under the overtaking criterion, as we ll as the conditions under which such a limit is the unique optimum under the sum-of -utilities criterion. The results are applied to a parametric example of the one-sector growth model to examine the impacts of discounting on optimal paths."}, {"id": "0803.4282", "abstract": "Inthispaperwecomparetwoclassical one-factor diﬀusionmo d- els which are used to model the term structure of interest rat es. One of them is based on the Wiener-Bachelier process while the se cond one is based on the Ornstein-Uhlenbeck process. We show essenti al diﬀer- ences between the prices of European call options on a zero-c oupon bond in these models."}, {"id": "0803.4480", "abstract": "ARCH and GARCH models assume either"}, {"id": "0803.1815", "abstract": "In this paper we study Backward Stochastic Diﬀerential Equations with two reﬂecting right continuous with left limits obstacles (or barriers) when the noise is giv en by Brownian motion and a Poisson random measure mutually independent. The jumps of the ob stacle processes could be either predictable or inaccessible. We show existence and uniqueness of th e solution when the barriers are completely separated and the generator uniformly Lipschitz. We do not assume the existence of a diﬀerence of supermartingales between the obstacles. As an applic ation, we show that the related mixed zero-sum diﬀerential-integral game problem has a value. AMS Classiﬁcation subjects : 91A15, 91B74, 60G40, 91A60 Key Words: Backward stochastic diﬀerential equation ; penalization ; M okobodski’s hypothesis ; Snell envelope ; zero-sum mixed diﬀerential-integral game. 1"}, {"id": "0803.3959", "abstract": "The method of cointegration in regression analysis is based on an assumption of stationary increments. Stationary increments with fixed time lag are called ‘integration I(d)’. A class of regression models where cointegration works was identified by Granger and yields the ergodic behavior required for equilibrium expectations in standard economics. Detrended finance market returns are martingales, and martingales do not satisfy regression equations. We extend the standard discussion to discover the class of detrended processes beyond standard regression models that satisfy integration I(d). In the language of econometrics, the models of interest are ‘unit root’ models, meaning martingales. Typical martingales do not have stationary increments, and those that do generally do not admit ergodicity. Our analysis leads us to comment on the lack of equilibrium observed earlier between FX rates and relative price levels. Key words: Integration I(d), cointegration, regression analysis, noise, unit root, ergodicity, stationary and nonstationary processes, stationary and nonstationary increments, martingales, white noise,"}, {"id": "0804.0185", "abstract": "Log-normal continuous random cascades form a class of multi fractal processes that has already been successfully used i n various ﬁelds. Several statistical issues related to this model are studied. We ﬁrst make a quick but extensive review of their ma in properties and show that most of these properties can be analytically st udied. We then develop an approximation theory of these proc esses in the limit of small intermittency λ2≪1,"}, {"id": "0804.0331", "abstract": ". Modelingtheevolutionofaﬁnancialindexasastochasticpr ocessisaproblemawaiting a full, satisfactory solution since it was ﬁrst formulated b y Bachelier in 1900. Here it is shown that the scaling with time of the return probability density func tion sampled from the historical series suggests a successful model. The resulting stochastic proc ess is a heteroskedastic, non-Markovian martingale,whichcanbeusedtosimulateindexevolutionon thebasisofanauto-regressive strategy. Results are fully consistent with volatility clustering an d with the multi-scaling properties of the returndistribution. Theideaofbasingtheprocessconstru ctiononscaling,andtheconstructionitself, arecloselyinspiredbytheprobabilisticrenormalization groupapproach ofstatisticalmechanics and byarecentformulationofthecentrallimittheoremforsums ofstronglycorrelatedrandomvariables."}, {"id": "0804.0482", "abstract": ". These lectures notes aim at introducing L\u0013 evy processes in an informal and intuitive way, accessible to non-specialists in the eld. In the rst part, we focus on the theory of L\u0013 evy processes. We analyze a `toy' example of a L\u0013 evy process, viz. a L\u0013 evy jump-di usion, which yet o ers signi cant insight into the distributional and path structure of a L\u0013 evy process. Then, we present several important results about L\u0013 evy processes, such as in nite divisibility and the L\u0013 evy-Khintchine formula, the L\u0013 evy-It^ o decomposition, the It^ o formula for L\u0013 evy processes and Gir- sanov's transformation. Some (sketches of) proofs are presented, still the majority of proofs is omitted and the reader is referred to textbooks instead. In the second part, we turn our attention to the applications of L\u0013 evy processes in nancial modeling and option pricing. We discuss how the price process of an asset can be modeled using L\u0013 evy processes and give a brief account of market incompleteness. Popular models in the literature are presented and revisited from the point of view of L\u0013 evy processes, and we also discuss three methods for pricing nancial deriva- tives. Finally, some indicative evidence from applications to market data is presented. Contents Part"}, {"id": "0804.0900", "abstract": ". TheFokker–Planckequationwithdiffusion coefficient quadraticin s pacevariab- le, linear drift coefficient, and nonlocal nonlinearity term is consider ed in the framework of a model of analysis of asset returns at financial markets. For spe cial cases of such a Fokker– Planck equation we describe a construction of exact solution of the Cauchy problem. In the general case, we construct the leading term of the Cauchy pr oblem solution asymptotic in a formal small parameter in semiclassical approximation following th e complex WKB– Maslov method in the class of trajectory concentrated functions . Key words: Fokker–Planck equation; semiclassical asymptotics; the Cauchy p roblem; non- linear evolution operator; trajectory concentrated functions 2000 Mathematics Subject Classiﬁcation: 35K55; 62M10; 91B28; 91B84 1"}, {"id": "0804.0902", "abstract": "We analyze the question whether sliding window time averages applied to stationary increment processes converge to a limit (in probability). The question centers on averages, correlations, and densities constructed via time averages of the increment x(t,T)=x(t+T)-x(t), e.g. x(t,T)=ln(p(t+T)/p(t)) in finance and economics where p(t) is a price, and the assu mption is that the increment is distributed independently of t. We show that the condition for applying Thebyshev’s Theorem to time averages of functions of stationary increments is strongly violated. We argue that, for both stationary and nonstationary increments, Tchebyshev’s Theorem provides the basis for constructing ensemble averages and densities from a single, historic time series if, as in FX markets, the series shows a definite ‘statistical periodicity’ on the average."}, {"id": "0804.1039", "abstract": "In this paper, the relevance of the Feller conditions in discrete time macro- nance term structure models is investigated. The Feller conditions are usually imposed on a continuous time multivariate square root process to ensure that the roots have nonneg- ative arguments. For a discrete time approximate model, the Feller conditions do not give this guarantee. Moreover, in a macro- nance context the restrictions imposed might be economically unappealing. At the same time, it has also been observed that even without the Feller conditions imposed, for a practically relevant term structure model, negative arguments rarely occur. Using models estimated on German data, we compare the yields implied by (approximate) analytic exponentially a\u000ene expressions to those ob- tained through Monte Carlo simulations of very high numbers of sample paths. It turns out that the di erences are rarely statistically signi cant, whether the Feller conditions are imposed or not. Moreover, economically the di erences are negligible, as they are always below one basis point."}, {"id": "0804.1229", "abstract": "We introduce a fully probabilistic framework of consumer product ch oice based on quality assessment. It allows us to capture many aspects of marke ting such as partial information asymmetry, quality diﬀerentiation, and product placem ent in a supermarket. 1"}, {"id": "0804.1414", "abstract": "We propose the new Top-Dog-Index to quantify the his- toric deviation of the supply data of many small branches for a commodity group from sales data. On the one hand, the common parametric assumptions on the customer de- mand distribution in the literature could not at all be sup- ported in our real-world data set. On the other hand, a reasonably-looking non-parametric approach to estimate the demand distribution for the different branches directly from the sales distribution could only provide us with statis- tically weak and unreliable estimates for the future demand. Based on real-world sales data from our industry partner we provide evidence that our Top-Dog-Index is statistically robust. Using the Top-Dog-Index, we propose a heuristics to improve the branch-dependent proportion between sup- ply and demand. Our approach cannot estimate the branch- dependent demand directly. It can, however, classify the branches into a given number of clusters according to an historic oversupply or undersupply. This classiﬁcation of branches can iteratively be used to adapt the branch distri- bution of supply and demand in the future."}, {"id": "0804.1642", "abstract": "The aim of this research is to give a simple framework to evalu - ate/quantize the transparency of a ﬁrm. We assume that the process of the ﬁrm value is only observable once in a while but is stron gly correlated with the stock price which is observable and trad able. This hybrid type structure make the transparency “observable”. The im- plication of the present study is that the depth of the shock t o the market caused by the precise accounting information does re ﬂect the degree of transparency. Furthermore, it can be quantized re sorting to the calibration method."}, {"id": "0804.1837", "abstract": "We present a new method of estimating the distribution of sal es rates of, e.g., book titles at an online bookstore, from the time evolution of ranking data found at websites of the store. The method is based on new mathematical results on an inﬁnite par ticle limit of the stochastic ranking process, and is suitable for quantitative studies of the lon g tail structure of online retails. We give an example of a ﬁt to the actual data obtained from Amazon.co. jp, which gives the Pareto slope parameter of the distribution of sales rates of the book titl es in the store. Key words: long tail; online retail; internet bookstore; ranking; Par eto"}]